
main.o1.exe:     file format elf32-littlearm

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .interp       00000013  00010154  00010154  00000154  2**0
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  1 .note.ABI-tag 00000020  00010168  00010168  00000168  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  2 .note.gnu.build-id 00000024  00010188  00010188  00000188  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  3 .gnu.hash     00000024  000101ac  000101ac  000001ac  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  4 .dynsym       00000040  000101d0  000101d0  000001d0  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  5 .dynstr       0000003c  00010210  00010210  00000210  2**0
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  6 .gnu.version  00000008  0001024c  0001024c  0000024c  2**1
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  7 .gnu.version_r 00000020  00010254  00010254  00000254  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  8 .rel.dyn      00000008  00010274  00010274  00000274  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  9 .rel.plt      00000018  0001027c  0001027c  0000027c  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
 10 .init         0000000c  00010294  00010294  00000294  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, CODE
 11 .plt          00000038  000102a0  000102a0  000002a0  2**2

 2b0:	325f4f49 	subscc	r4, pc, #292	; 0x124
 2b4:	735f315f 	cmpvc	pc, #-1073741801	; 0xc0000017
 2b8:	756f6474 	strbvc	r6, [pc, #-1140]!	; fffffe4c <__bss_end__+0xfffdee24>
 2bc:	5f005f74 	svcpl	0x00005f74
 2c0:	6c5f4f49 	mrrcvs	15, 4, r4, pc, cr9	; <UNPREDICTABLE>
 2c4:	5f6b636f 	svcpl	0x006b636f
 2c8:	Address 0x00000000000002c8 is out of bounds.


Disassembly of section .debug_loc:

00000000 <.debug_loc>:
   0:	00000000 	andeq	r0, r0, r0
   4:	00000008 	andeq	r0, r0, r8
   8:	08500001 	ldmdaeq	r0, {r0}^
   c:	10000000 	andne	r0, r0, r0
  10:	04000000 	streq	r0, [r0], #-0
  14:	5001f300 	andpl	pc, r1, r0, lsl #6
  18:	0000009f 	muleq	r0, pc, r0	; <UNPREDICTABLE>
	...
  24:	00000800 	andeq	r0, r0, r0, lsl #16
  28:	70000800 	andvc	r0, r0, r0, lsl #16
  2c:	082b3000 	stmdaeq	fp!, {ip, sp}
  30:	089f1aff 	ldmeq	pc, {r0, r1, r2, r3, r4, r5, r6, r7, r9, fp, ip}	; <UNPREDICTABLE>
  34:	10000000 	andne	r0, r0, r0
  38:	09000000 	stmdbeq	r0, {}	; <UNPREDICTABLE>
  3c:	5001f300 	andpl	pc, r1, r0, lsl #6
  40:	ff082b30 			; <UNDEFINED> instruction: 0xff082b30
  44:	00009f1a 	andeq	r9, r0, sl, lsl pc
  48:	00000000 	andeq	r0, r0, r0
	...
Contents of the .eh_frame section:


00000000 ZERO terminator


Contents of the .debug_aranges section:

  Length:                   28
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    000103c8 00000018 
    00000000 00000000 

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x377 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x131): GNU C11 7.5.0 -marm -march=armv5t -mfloat-abi=soft -mtls-dialect=gnu -g -O1 -fstack-protector-strong
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x211): main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa2): /external/scratch/autogen/06
    <19>   DW_AT_low_pc      : 0x103c8
    <1d>   DW_AT_high_pc     : 0x18
    <21>   DW_AT_stmt_list   : 0x0
 <1><25>: Abbrev Number: 2 (DW_TAG_typedef)
    <26>   DW_AT_name        : (indirect string, offset: 0x48): size_t
    <2a>   DW_AT_decl_file   : 2
    <2b>   DW_AT_decl_line   : 216
    <2c>   DW_AT_type        : <0x30>
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x124): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 1
    <39>   DW_AT_encoding    : 8	(unsigned char)
    <3a>   DW_AT_name        : (indirect string, offset: 0xfd): unsigned char
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 2
    <40>   DW_AT_encoding    : 7	(unsigned)
    <41>   DW_AT_name        : (indirect string, offset: 0x1d0): short unsigned int
 <1><45>: Abbrev Number: 3 (DW_TAG_base_type)
    <46>   DW_AT_byte_size   : 4
    <47>   DW_AT_encoding    : 7	(unsigned)
    <48>   DW_AT_name        : (indirect string, offset: 0x11f): long unsigned int
 <1><4c>: Abbrev Number: 3 (DW_TAG_base_type)
    <4d>   DW_AT_byte_size   : 1
    <4e>   DW_AT_encoding    : 6	(signed char)
    <4f>   DW_AT_name        : (indirect string, offset: 0xff): signed char
 <1><53>: Abbrev Number: 3 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 2
    <55>   DW_AT_encoding    : 5	(signed)
    <56>   DW_AT_name        : (indirect string, offset: 0x3e): short int
 <1><5a>: Abbrev Number: 4 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 4
    <5c>   DW_AT_encoding    : 5	(signed)
    <5d>   DW_AT_name        : int
 <1><61>: Abbrev Number: 3 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 8
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : (indirect string, offset: 0x94): long long int
 <1><68>: Abbrev Number: 3 (DW_TAG_base_type)
    <69>   DW_AT_byte_size   : 8
    <6a>   DW_AT_encoding    : 7	(unsigned)
    <6b>   DW_AT_name        : (indirect string, offset: 0x11a): long long unsigned int
 <1><6f>: Abbrev Number: 2 (DW_TAG_typedef)
    <70>   DW_AT_name        : (indirect string, offset: 0xc): __quad_t
    <74>   DW_AT_decl_file   : 3
    <75>   DW_AT_decl_line   : 55
    <76>   DW_AT_type        : <0x61>
 <1><7a>: Abbrev Number: 2 (DW_TAG_typedef)
    <7b>   DW_AT_name        : (indirect string, offset: 0x230): __off_t
    <7f>   DW_AT_decl_file   : 3
    <80>   DW_AT_decl_line   : 140
    <81>   DW_AT_type        : <0x85>
 <1><85>: Abbrev Number: 3 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : (indirect string, offset: 0x99): long int
 <1><8c>: Abbrev Number: 2 (DW_TAG_typedef)
    <8d>   DW_AT_name        : (indirect string, offset: 0x226): __off64_t
    <91>   DW_AT_decl_file   : 3
    <92>   DW_AT_decl_line   : 141
    <93>   DW_AT_type        : <0x6f>
 <1><97>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <98>   DW_AT_byte_size   : 4
 <1><99>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_type        : <0x9f>
 <1><9f>: Abbrev Number: 3 (DW_TAG_base_type)
    <a0>   DW_AT_byte_size   : 1
    <a1>   DW_AT_encoding    : 8	(unsigned char)
    <a2>   DW_AT_name        : (indirect string, offset: 0x106): char
 <1><a6>: Abbrev Number: 7 (DW_TAG_const_type)
    <a7>   DW_AT_type        : <0x9f>
 <1><ab>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ac>   DW_AT_name        : (indirect string, offset: 0xf4): _IO_FILE
    <b0>   DW_AT_byte_size   : 152
    <b1>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 245
    <b3>   DW_AT_sibling     : <0x22b>
 <2><b7>: Abbrev Number: 9 (DW_TAG_member)
    <b8>   DW_AT_name        : (indirect string, offset: 0x5d): _flags
    <bc>   DW_AT_decl_file   : 4
    <bd>   DW_AT_decl_line   : 246
    <be>   DW_AT_type        : <0x5a>
    <c2>   DW_AT_data_member_location: 0
 <2><c3>: Abbrev Number: 9 (DW_TAG_member)
    <c4>   DW_AT_name        : (indirect string, offset: 0x1c3): _IO_read_ptr
    <c8>   DW_AT_decl_file   : 4
    <c9>   DW_AT_decl_line   : 251
    <ca>   DW_AT_type        : <0x99>
    <ce>   DW_AT_data_member_location: 4
 <2><cf>: Abbrev Number: 9 (DW_TAG_member)
    <d0>   DW_AT_name        : (indirect string, offset: 0x80): _IO_read_end
    <d4>   DW_AT_decl_file   : 4
    <d5>   DW_AT_decl_line   : 252
    <d6>   DW_AT_type        : <0x99>
    <da>   DW_AT_data_member_location: 8
 <2><db>: Abbrev Number: 9 (DW_TAG_member)
    <dc>   DW_AT_name        : (indirect string, offset: 0x263): _IO_read_base
    <e0>   DW_AT_decl_file   : 4
    <e1>   DW_AT_decl_line   : 253
    <e2>   DW_AT_type        : <0x99>
    <e6>   DW_AT_data_member_location: 12
 <2><e7>: Abbrev Number: 9 (DW_TAG_member)
    <e8>   DW_AT_name        : (indirect string, offset: 0x1ab): _IO_write_base
    <ec>   DW_AT_decl_file   : 4
    <ed>   DW_AT_decl_line   : 254
    <ee>   DW_AT_type        : <0x99>
    <f2>   DW_AT_data_member_location: 16
 <2><f3>: Abbrev Number: 9 (DW_TAG_member)
    <f4>   DW_AT_name        : (indirect string, offset: 0x4f): _IO_write_ptr
    <f8>   DW_AT_decl_file   : 4
    <f9>   DW_AT_decl_line   : 255
    <fa>   DW_AT_type        : <0x99>
    <fe>   DW_AT_data_member_location: 20
 <2><ff>: Abbrev Number: 10 (DW_TAG_member)
    <100>   DW_AT_name        : (indirect string, offset: 0x218): _IO_write_end
    <104>   DW_AT_decl_file   : 4
    <105>   DW_AT_decl_line   : 256
    <107>   DW_AT_type        : <0x99>
    <10b>   DW_AT_data_member_location: 24
 <2><10c>: Abbrev Number: 10 (DW_TAG_member)
    <10d>   DW_AT_name        : (indirect string, offset: 0x64): _IO_buf_base
    <111>   DW_AT_decl_file   : 4
    <112>   DW_AT_decl_line   : 257
    <114>   DW_AT_type        : <0x99>
    <118>   DW_AT_data_member_location: 28
 <2><119>: Abbrev Number: 10 (DW_TAG_member)
    <11a>   DW_AT_name        : (indirect string, offset: 0x0): _IO_buf_end
    <11e>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 258
    <121>   DW_AT_type        : <0x99>
    <125>   DW_AT_data_member_location: 32
 <2><126>: Abbrev Number: 10 (DW_TAG_member)
    <127>   DW_AT_name        : (indirect string, offset: 0x286): _IO_save_base
    <12b>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 260
    <12e>   DW_AT_type        : <0x99>
    <132>   DW_AT_data_member_location: 36
 <2><133>: Abbrev Number: 10 (DW_TAG_member)
    <134>   DW_AT_name        : (indirect string, offset: 0x23f): _IO_backup_base
    <138>   DW_AT_decl_file   : 4
    <139>   DW_AT_decl_line   : 261
    <13b>   DW_AT_type        : <0x99>
    <13f>   DW_AT_data_member_location: 40
 <2><140>: Abbrev Number: 10 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x31): _IO_save_end
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 262
    <148>   DW_AT_type        : <0x99>
    <14c>   DW_AT_data_member_location: 44
 <2><14d>: Abbrev Number: 10 (DW_TAG_member)
    <14e>   DW_AT_name        : (indirect string, offset: 0x77): _markers
    <152>   DW_AT_decl_file   : 4
    <153>   DW_AT_decl_line   : 264
    <155>   DW_AT_type        : <0x263>
    <159>   DW_AT_data_member_location: 48
 <2><15a>: Abbrev Number: 10 (DW_TAG_member)
    <15b>   DW_AT_name        : (indirect string, offset: 0x238): _chain
    <15f>   DW_AT_decl_file   : 4
    <160>   DW_AT_decl_line   : 266
    <162>   DW_AT_type        : <0x269>
    <166>   DW_AT_data_member_location: 52
 <2><167>: Abbrev Number: 10 (DW_TAG_member)
    <168>   DW_AT_name        : (indirect string, offset: 0x2a0): _fileno
    <16c>   DW_AT_decl_file   : 4
    <16d>   DW_AT_decl_line   : 268
    <16f>   DW_AT_type        : <0x5a>
    <173>   DW_AT_data_member_location: 56
 <2><174>: Abbrev Number: 10 (DW_TAG_member)
    <175>   DW_AT_name        : (indirect string, offset: 0x255): _flags2
    <179>   DW_AT_decl_file   : 4
    <17a>   DW_AT_decl_line   : 272
    <17c>   DW_AT_type        : <0x5a>
    <180>   DW_AT_data_member_location: 60
 <2><181>: Abbrev Number: 10 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x1c): _old_offset
    <186>   DW_AT_decl_file   : 4
    <187>   DW_AT_decl_line   : 274
    <189>   DW_AT_type        : <0x7a>
    <18d>   DW_AT_data_member_location: 64
 <2><18e>: Abbrev Number: 10 (DW_TAG_member)
    <18f>   DW_AT_name        : (indirect string, offset: 0xbf): _cur_column
    <193>   DW_AT_decl_file   : 4
    <194>   DW_AT_decl_line   : 278
    <196>   DW_AT_type        : <0x3e>
    <19a>   DW_AT_data_member_location: 68
 <2><19b>: Abbrev Number: 10 (DW_TAG_member)
    <19c>   DW_AT_name        : (indirect string, offset: 0x277): _vtable_offset
    <1a0>   DW_AT_decl_file   : 4
    <1a1>   DW_AT_decl_line   : 279
    <1a3>   DW_AT_type        : <0x4c>
    <1a7>   DW_AT_data_member_location: 70
 <2><1a8>: Abbrev Number: 10 (DW_TAG_member)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x1a1): _shortbuf
    <1ad>   DW_AT_decl_file   : 4
    <1ae>   DW_AT_decl_line   : 280
    <1b0>   DW_AT_type        : <0x26f>
    <1b4>   DW_AT_data_member_location: 71
 <2><1b5>: Abbrev Number: 10 (DW_TAG_member)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x71): _lock
    <1ba>   DW_AT_decl_file   : 4
    <1bb>   DW_AT_decl_line   : 284
    <1bd>   DW_AT_type        : <0x27f>
    <1c1>   DW_AT_data_member_location: 72
 <2><1c2>: Abbrev Number: 10 (DW_TAG_member)
    <1c3>   DW_AT_name        : (indirect string, offset: 0x20): _offset
    <1c7>   DW_AT_decl_file   : 4
    <1c8>   DW_AT_decl_line   : 293
    <1ca>   DW_AT_type        : <0x8c>
    <1ce>   DW_AT_data_member_location: 80
 <2><1cf>: Abbrev Number: 10 (DW_TAG_member)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x1ee): __pad1
    <1d4>   DW_AT_decl_file   : 4
    <1d5>   DW_AT_decl_line   : 301
    <1d7>   DW_AT_type        : <0x97>
    <1db>   DW_AT_data_member_location: 88
 <2><1dc>: Abbrev Number: 10 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x1f5): __pad2
    <1e1>   DW_AT_decl_file   : 4
    <1e2>   DW_AT_decl_line   : 302
    <1e4>   DW_AT_type        : <0x97>
    <1e8>   DW_AT_data_member_location: 92
 <2><1e9>: Abbrev Number: 10 (DW_TAG_member)
    <1ea>   DW_AT_name        : (indirect string, offset: 0x1fc): __pad3
    <1ee>   DW_AT_decl_file   : 4
    <1ef>   DW_AT_decl_line   : 303
    <1f1>   DW_AT_type        : <0x97>
    <1f5>   DW_AT_data_member_location: 96
 <2><1f6>: Abbrev Number: 10 (DW_TAG_member)
    <1f7>   DW_AT_name        : (indirect string, offset: 0x203): __pad4
    <1fb>   DW_AT_decl_file   : 4
    <1fc>   DW_AT_decl_line   : 304
    <1fe>   DW_AT_type        : <0x97>
    <202>   DW_AT_data_member_location: 100
 <2><203>: Abbrev Number: 10 (DW_TAG_member)
    <204>   DW_AT_name        : (indirect string, offset: 0x20a): __pad5
    <208>   DW_AT_decl_file   : 4
    <209>   DW_AT_decl_line   : 306
    <20b>   DW_AT_type        : <0x25>
    <20f>   DW_AT_data_member_location: 104
 <2><210>: Abbrev Number: 10 (DW_TAG_member)
    <211>   DW_AT_name        : (indirect string, offset: 0x25d): _mode
    <215>   DW_AT_decl_file   : 4
    <216>   DW_AT_decl_line   : 307
    <218>   DW_AT_type        : <0x5a>
    <21c>   DW_AT_data_member_location: 108
 <2><21d>: Abbrev Number: 10 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x1ba): _unused2
    <222>   DW_AT_decl_file   : 4
    <223>   DW_AT_decl_line   : 309
    <225>   DW_AT_type        : <0x285>
    <229>   DW_AT_data_member_location: 112
 <2><22a>: Abbrev Number: 0
 <1><22b>: Abbrev Number: 11 (DW_TAG_typedef)
    <22c>   DW_AT_name        : (indirect string, offset: 0x2bf): _IO_lock_t
    <230>   DW_AT_decl_file   : 4
    <231>   DW_AT_decl_line   : 154
 <1><232>: Abbrev Number: 8 (DW_TAG_structure_type)
    <233>   DW_AT_name        : (indirect string, offset: 0x196): _IO_marker
    <237>   DW_AT_byte_size   : 12
    <238>   DW_AT_decl_file   : 4
    <239>   DW_AT_decl_line   : 160
    <23a>   DW_AT_sibling     : <0x263>
 <2><23e>: Abbrev Number: 9 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x1e8): _next
    <243>   DW_AT_decl_file   : 4
    <244>   DW_AT_decl_line   : 161
    <245>   DW_AT_type        : <0x263>
    <249>   DW_AT_data_member_location: 0
 <2><24a>: Abbrev Number: 9 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0xee): _sbuf
    <24f>   DW_AT_decl_file   : 4
    <250>   DW_AT_decl_line   : 162
    <251>   DW_AT_type        : <0x269>
    <255>   DW_AT_data_member_location: 4
 <2><256>: Abbrev Number: 9 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0xe9): _pos
    <25b>   DW_AT_decl_file   : 4
    <25c>   DW_AT_decl_line   : 166
    <25d>   DW_AT_type        : <0x5a>
    <261>   DW_AT_data_member_location: 8
 <2><262>: Abbrev Number: 0
 <1><263>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <264>   DW_AT_byte_size   : 4
    <265>   DW_AT_type        : <0x232>
 <1><269>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <26a>   DW_AT_byte_size   : 4
    <26b>   DW_AT_type        : <0xab>
 <1><26f>: Abbrev Number: 12 (DW_TAG_array_type)
    <270>   DW_AT_type        : <0x9f>
    <274>   DW_AT_sibling     : <0x27f>
 <2><278>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <279>   DW_AT_type        : <0x30>
    <27d>   DW_AT_upper_bound : 0
 <2><27e>: Abbrev Number: 0
 <1><27f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <280>   DW_AT_byte_size   : 4
    <281>   DW_AT_type        : <0x22b>
 <1><285>: Abbrev Number: 12 (DW_TAG_array_type)
    <286>   DW_AT_type        : <0x9f>
    <28a>   DW_AT_sibling     : <0x295>
 <2><28e>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <28f>   DW_AT_type        : <0x30>
    <293>   DW_AT_upper_bound : 39
 <2><294>: Abbrev Number: 0
 <1><295>: Abbrev Number: 14 (DW_TAG_structure_type)
    <296>   DW_AT_name        : (indirect string, offset: 0xdb): _IO_FILE_plus
    <29a>   DW_AT_declaration : 1
 <1><29a>: Abbrev Number: 15 (DW_TAG_variable)
    <29b>   DW_AT_name        : (indirect string, offset: 0x10b): _IO_2_1_stdin_
    <29f>   DW_AT_decl_file   : 4
    <2a0>   DW_AT_decl_line   : 319
    <2a2>   DW_AT_type        : <0x295>
    <2a6>   DW_AT_external    : 1
    <2a6>   DW_AT_declaration : 1
 <1><2a6>: Abbrev Number: 15 (DW_TAG_variable)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x2af): _IO_2_1_stdout_
    <2ab>   DW_AT_decl_file   : 4
    <2ac>   DW_AT_decl_line   : 320
    <2ae>   DW_AT_type        : <0x295>
    <2b2>   DW_AT_external    : 1
    <2b2>   DW_AT_declaration : 1
 <1><2b2>: Abbrev Number: 15 (DW_TAG_variable)
    <2b3>   DW_AT_name        : (indirect string, offset: 0xcb): _IO_2_1_stderr_
    <2b7>   DW_AT_decl_file   : 4
    <2b8>   DW_AT_decl_line   : 321
    <2ba>   DW_AT_type        : <0x295>
    <2be>   DW_AT_external    : 1
    <2be>   DW_AT_declaration : 1
 <1><2be>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2bf>   DW_AT_byte_size   : 4
    <2c0>   DW_AT_type        : <0xa6>
 <1><2c4>: Abbrev Number: 7 (DW_TAG_const_type)
    <2c5>   DW_AT_type        : <0x2be>
 <1><2c9>: Abbrev Number: 16 (DW_TAG_variable)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x24f): stdin
    <2ce>   DW_AT_decl_file   : 5
    <2cf>   DW_AT_decl_line   : 135
    <2d0>   DW_AT_type        : <0x269>
    <2d4>   DW_AT_external    : 1
    <2d4>   DW_AT_declaration : 1
 <1><2d4>: Abbrev Number: 16 (DW_TAG_variable)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x2a8): stdout
    <2d9>   DW_AT_decl_file   : 5
    <2da>   DW_AT_decl_line   : 136
    <2db>   DW_AT_type        : <0x269>
    <2df>   DW_AT_external    : 1
    <2df>   DW_AT_declaration : 1
 <1><2df>: Abbrev Number: 16 (DW_TAG_variable)
    <2e0>   DW_AT_name        : (indirect string, offset: 0x8d): stderr
    <2e4>   DW_AT_decl_file   : 5
    <2e5>   DW_AT_decl_line   : 137
    <2e6>   DW_AT_type        : <0x269>
    <2ea>   DW_AT_external    : 1
    <2ea>   DW_AT_declaration : 1
 <1><2ea>: Abbrev Number: 16 (DW_TAG_variable)
    <2eb>   DW_AT_name        : (indirect string, offset: 0x28): sys_nerr
    <2ef>   DW_AT_decl_file   : 6
    <2f0>   DW_AT_decl_line   : 26
    <2f1>   DW_AT_type        : <0x5a>
    <2f5>   DW_AT_external    : 1
    <2f5>   DW_AT_declaration : 1
 <1><2f5>: Abbrev Number: 12 (DW_TAG_array_type)
    <2f6>   DW_AT_type        : <0x2c4>
    <2fa>   DW_AT_sibling     : <0x300>
 <2><2fe>: Abbrev Number: 17 (DW_TAG_subrange_type)
 <2><2ff>: Abbrev Number: 0
 <1><300>: Abbrev Number: 7 (DW_TAG_const_type)
    <301>   DW_AT_type        : <0x2f5>
 <1><305>: Abbrev Number: 16 (DW_TAG_variable)
    <306>   DW_AT_name        : (indirect string, offset: 0x294): sys_errlist
    <30a>   DW_AT_decl_file   : 6
    <30b>   DW_AT_decl_line   : 27
